let DATA = {
  全台: {
    北區: {
      新北市: {
        新店區: ["新店光明店", "新店中正(研磨咖啡)店", "新店大豐店"],
        三重區: [
          "三重自強店",
          "三重長壽店",
          "三重溪尾店",
          "三重文化店",
          "三重五華店",
          "三重中華店",
          "三重大同店",
          "三重力行(研磨咖啡)店",
        ],
        板橋區: [
          "板橋文德店",
          "板橋華興店",
          "板橋民治店",
          "板橋中正店",
          "板橋民生店",
          "亞東科大店",
          "板橋松柏店",
          "板橋遠百店",
          "亞東醫院店",
          "板橋重慶店",
          "板橋四雅店",
        ],
        三峽區: ["三峽光明店", "三峽北大店"],
        淡水區: ["淡水沙崙店", "淡水中正店", "淡水竹圍店", "淡水北新店"],
        泰山區: ["泰山全興店", "泰山明志店"],
        樹林區: ["樹林太元店", "樹林博愛店", "樹林金門店", "新北樹林店"],
        汐止區: ["汐止大同店", "汐止忠孝店"],
        林口區: ["林口文化店"],
        八里區: ["八里中山店"],
        蘆洲區: ["蘆洲信義店", "蘆洲復興(研磨咖啡)店", "蘆洲長安店"],
        五股區: ["五股新成泰(研磨咖啡)店"],
        深坑區: ["深坑埔新店"],
        土城區: ["土城延吉店", "土城光明店"],
        新莊區: [
          "新莊西盛店",
          "新莊新泰店",
          "新莊化成(研磨咖啡)店",
          "新莊福壽店",
          "新莊化成店",
          "新莊中和店",
          "新莊輔大店",
          "輔大文園店",
          "新莊新莊(研磨咖啡)店",
          "新莊中港(研磨咖啡)店",
          "新莊後港店",
        ],
        永和區: ["永和民生店", "永和頂溪店", "永和得和店"],
        中和區: [
          "中和南山(研磨咖啡)店",
          "中和大勇店",
          "中和宜安店",
          "中和民安店",
          "中和遠東廣場店",
          "中和南華店",
          "中和環球店",
          "中和中山店",
          "中和民享店",
          "中和中安店",
        ],
      },
      基隆市: {
        安樂區: ["基隆安一店"],
        暖暖區: ["基隆暖暖店"],
        七堵區: ["基隆七堵店"],
        仁愛區: ["基隆廟口(研磨咖啡)店"],
        中正區: ["基隆新豐店", "基隆海洋店"],
      },
      桃園市: {
        桃園區: ["桃園桃鶯店", "桃園中山店", "桃園寶山店", "桃園中正店"],
        八德區: ["八德福國店", "八德義勇店"],
        大園區: ["大園菓林店", "大園中正東店"],
        楊梅區: ["楊梅大成店", "楊梅文化店", "桃園埔心(研磨咖啡)店"],
        龜山區: [
          "龜山德明店",
          "林口長庚店",
          "林口復興(研磨咖啡)店",
          "桃園迴龍店",
        ],
        觀音區: ["觀音成功店"],
        大溪區: ["大溪得勝(研磨咖啡)店"],
        蘆竹區: ["桃園南崁店"],
        龍潭區: ["桃園龍潭店"],
        平鎮區: ["平鎮南豐店"],
        中壢區: [
          "中壢中原店",
          "中壢龍東店",
          "桃園青埔店",
          "中壢民族店",
          "中壢威尼斯店",
          "中壢 sogo (研磨咖啡)店",
        ],
      },
      台北市: {
        松山區: ["新東店", "台北西松店", "慶城店", "新東(研磨咖啡)店"],
        信義區: [
          "台北中坡店",
          "台北永春店",
          "北醫店",
          "台北市府(研磨咖啡)店",
          "台北永吉(研磨咖啡)店",
        ],
        大同區: ["台北延三店", "台北圓山店"],
        北投區: [
          "台北明德店",
          "石牌國中店",
          "北投吉利店",
          "北投奇岩店",
          "北投榮總(研磨咖啡)店",
          "北投溫泉(研磨咖啡)店",
          "石牌致遠(研磨咖啡)店",
          "石牌裕民店",
        ],
        士林區: [
          "台北德行東店",
          "士林大南(研磨咖啡)店",
          "士林美崙(研磨咖啡)店",
          "台北芝山店",
          "台北天母店",
          "士林文化店",
          "社子延平店",
        ],
        內湖區: [
          "台北江南店",
          "台北葫州店",
          "台北內湖(研磨咖啡)店",
          "西湖(研磨咖啡)店",
        ],
        中山區: [
          "台北龍江店",
          "大直北安店",
          "台北民權西店",
          "台北復錦店",
          "林森欣欣(研磨咖啡)店",
          "台北錦州(研磨咖啡)店",
        ],
        大安區: ["科技大樓店", "台北安居店", "台北科大店", "忠孝 sogo 店"],
        文山區: [
          "台北景興店",
          "台北木柵店",
          "景美景中店",
          "木柵世新(研磨咖啡)店",
        ],
        中正區: [
          "台北忠孝東店",
          "台北衡陽店",
          "台北汀州店",
          "台北公館店",
          "台北南陽(研磨咖啡)店",
          "台北光華(研磨咖啡)店",
        ],
        南港區: ["南港昆陽(研磨咖啡)店"],
      },
      新竹市: {
        東區: ["新竹民族店"],
        北區: ["新竹光華(研磨咖啡)店"],
      },
    },
    南區: {
      台南市: {
        善化區: ["台南善化店"],
      },
      高雄市: {
        三民區: ["高雄熱河店"],
      },
      屏東縣: {
        屏東市: ["屏東林森店"],
        潮州鎮: ["潮州興隆店"],
      },
    },
    中區: {
      彰化縣: {
        彰化市: ["彰化民生店"],
      },
    },
    東區: {
      花蓮縣: {
        花蓮市: ["花蓮中山店", "花蓮新港店"],
        玉里鎮: ["花蓮玉里店"],
      },
      宜蘭縣: {
        宜蘭市: ["宜蘭舊城店", "宜蘭復興店", "宜蘭中山店"],
        羅東鎮: ["羅東羅商店", "羅東站前店", "羅東夜市店"],
        員山鄉: ["宜蘭員山店"],
        壯圍鄉: ["宜蘭壯圍店"],
        五結鄉: ["宜蘭五結店"],
        冬山鄉: ["宜蘭冬山店"],
        頭城鎮: ["宜蘭頭城店"],
        礁溪鄉: ["宜蘭礁溪店"],
      },
    },
    離島: {
      澎湖縣: {
        馬公市: ["澎湖三多店", "澎湖中華(研磨咖啡)店", "澎湖中正(研磨咖啡)店"],
      },
      金門縣: {
        金門: ["金門復興店"],
      },
    },
  },
};

function test(a) {
  if (Array.isArray(a)) {
    return a.reduce((acc, curr) => ((acc[curr] = false), acc), {});
  } else {
    const key = Object.keys(a);
    return key.reduce(
      (acc, curr) => (
        (acc[curr] = {
          chosen: false,
          collapsed: false,
          children: test(a[curr]),
        }),
        acc
      ),
      {}
    );
  }
}

let answer = [
  ["北區", "台北市", "東區", "松山店"],
  ["東區", "花蓮市", "埔里鎮", "英英殿"],
];

console.log(
  answer
    .map((m) => m.map((t, index) => ({ name: t, index })))
    .flat()
    .filter(
      (item, index, inputArray) =>
        inputArray.findIndex(
          (i) => i.name === item.name && i.index === item.index
        ) === index
    )
);
